Hi!

I have the same issue without the attachment. Here is my very simplified infra:
```hcl
provider "aws" {
  version = "~> 2.20.0"
  region = "eu-west-1"
}

resource "aws_kms_key" "test" {}

resource "aws_kms_alias" "test" {
  name = "alias/my_alias"
  target_key_id = aws_kms_key.test.id
}

resource "aws_ebs_volume" "test" {
  availability_zone = "eu-west-1a"
  encrypted = true
  kms_key_id = aws_kms_alias.test.arn
  size = 8
}
```
The first apply creates the volume, but if I do a plan after Terraform wants to re-create it with the arn of the key and not the alias one:

```
$ ../commons/bin/terraform apply
aws_kms_key.test: Refreshing state... [id=046bd8fd-b3f2-4bb9-a39b-1efe7193dd20]
aws_kms_alias.test: Refreshing state... [id=alias/my_alias]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ebs_volume.test will be created
  + resource "aws_ebs_volume" "test" {
      + arn               = (known after apply)
      + availability_zone = "eu-west-1a"
      + encrypted         = true
      + id                = (known after apply)
      + iops              = (known after apply)
      + kms_key_id        = "arn:aws:kms:eu-west-1:162314847236:alias/my_alias"
      + size              = 8
      + snapshot_id       = (known after apply)
      + type              = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_ebs_volume.test: Creating...
aws_ebs_volume.test: Still creating... [10s elapsed]
aws_ebs_volume.test: Creation complete after 11s [id=vol-05b26e72a2fa269a4]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

$ terraform plan
aws_kms_key.test: Refreshing state... [id=046bd8fd-b3f2-4bb9-a39b-1efe7193dd20]
aws_kms_alias.test: Refreshing state... [id=alias/my_alias]
aws_ebs_volume.test: Refreshing state... [id=vol-05b26e72a2fa269a4]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ebs_volume.test must be replaced
-/+ resource "aws_ebs_volume" "test" {
      ~ arn               = "arn:aws:ec2:eu-west-1:162314847236:volume/vol-05b26e72a2fa269a4" -> (known after apply)
        availability_zone = "eu-west-1a"
        encrypted         = true
      ~ id                = "vol-05b26e72a2fa269a4" -> (known after apply)
      ~ iops              = 0 -> (known after apply)
      ~ kms_key_id        = "arn:aws:kms:eu-west-1:162314847236:key/046bd8fd-b3f2-4bb9-a39b-1efe7193dd20" -> "arn:aws:kms:eu-west-1:162314847236:alias/my_alias" # forces replacement
        size              = 8
      + snapshot_id       = (known after apply)
      - tags              = {} -> null
      ~ type              = "standard" -> (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
I'm using the version 0.12 of Terraform and the version 2.20 of the AWS provider.